
ex = 1

l_1 = [[' ', ' ', ' ', ' ', ' '],
       [' ', ' ', ' ', ' ', ' '],
       [' ', ' ', ' ', ' ', ' '],
       [' ', ' ', ' ', ' ', ' '],
       [' ', ' ', ' ', ' ', ' ']]
while ex == 1:
    print('---------------------------------------------------------------------------\n'
          ' Y\n'
          ' +---+---+---+---+---+\n'
          f'4| {l_1[0][4]} | {l_1[1][4]} | {l_1[2][4]} | {l_1[3][4]} | {l_1[4][4]} |\n'
          ' +---+---+---+---+---+\n'
          f'3| {l_1[0][3]} | {l_1[1][3]} | {l_1[2][3]} | {l_1[3][3]} | {l_1[4][3]} |\n'
          ' +---+---+---+---+---+\n'
          f'2| {l_1[0][2]} | {l_1[1][2]} | {l_1[2][2]} | {l_1[3][2]} | {l_1[4][2]} |\n'
          ' +---+---+---+---+---+\n'
          f'1| {l_1[0][1]} | {l_1[1][1]} | {l_1[2][1]} | {l_1[3][1]} | {l_1[4][1]} |\n'
          ' +---+---+---+---+---+\n'
          f'0| {l_1[0][0]} | {l_1[1][0]} | {l_1[2][0]} | {l_1[3][0]} | {l_1[4][0]} |\n'
          ' +---+---+---+---+---+ X\n'
          '   0   1   2   3   4')
    while ex == 1:
        command = int(input('''\nВыбери действие:
        1) Сделать запись
        2) Получить значение по координатам
        3) Показать все ячейки
        4) Удалить значение по координатам
        0) Программа завершает работу.
        : '''))
        if not 0 <= command <= 4:
            print('Вы ввели не верное значение. Сделайте выбор еще раз.')
            continue
        elif command == 1:
            while ex == 1:
                print('Введите координаты ячейки "x" и "y" и ее значение value=" ":')
                x = int(input('х = '))
                y = int(input('y = '))
                v = input('value= ')
                if l_1[x][y] == ' ':
                    l_1[x][y] = v
                    print('Запись сделана!\n')
                    break
                else:
                    accept = int(input('Ячейка занята! Перезаписать? 1) Да. 2) НЕТ! : '))
                    if accept == 1:
                        l_1[x][y] = v
                        print('Запись сделана!\n')
                        break
                    else: continue
        elif command == 2:
            print('Введите координаты ячейки "x" и "y"')
            x = int(input('x= '))
            y = int(input('у= '))
            if l_1[x][y] == ' ':
                print(f'Ячейка [{x}, {y}] - пустая.')
                continue
            else:
                print(f'Значение ячейки [{x}, {y}] = {l_1[x][y]}')
                continue
        elif command == 3:
            break
        elif command == 4:
            print('Введите координаты ячейки "x" и "y" для ее УДАЛЕНИЯ:')
            x = int(input('х = '))
            y = int(input('y = '))
            print(f'Ячейка [{x}, {y}] - УДАЛЕНА!')
            l_1[x][y] = ' '
            continue
        elif command == 0:
            ex = 0
            break
        else: break
